import pandas as pd

people = {
    "user_01": {
        "прізвисько": "Козак",
        "телефон": "+380931112233",
        "місто": "Київ"
    },
    "user_02": {
        "прізвисько": "Вовк",
        "телефон": "+380671234567",
        "місто": "Львів"
    },
    "user_03": {
        "прізвисько": "Сокіл",
        "телефон": "+380501234567",
        "місто": "Харків"
    },
    "user_04": {
        "прізвисько": "Тигр",
        "телефон": "+380991234567",
        "місто": "Київ"
    },
    "user_05": {
        "прізвисько": "Барс",
        "телефон": "+380981234567",
        "місто": "Одеса"
    },
    "user_06": {
        "прізвисько": "Яструб",
        "телефон": "+380661234567",
        "місто": "Львів"
    },
    "user_07": {
        "прізвисько": "Орел",
        "телефон": "+380931234567",
        "місто": "Харків"
    },
    "user_08": {
        "прізвисько": "Зубр",
        "телефон": "+380671112233",
        "місто": "Київ"
    }
}

df = pd.DataFrame(people).T

selected_cities_df = df[df['місто'].isin(['Київ', 'Львів'])]

grouped_df = selected_cities_df.groupby('місто').agg({'прізвисько': 'count'}).rename(columns={'прізвисько': 'кількість_користувачів'})

print("Весь дата-фрейм:\n", df)
print("\nКористувачі з міст Київ та Львів:\n", selected_cities_df)
print("\nКількість користувачів у кожному місті (Київ, Львів):\n", grouped_df)
